#include <stdio.h>
#define 月份 12

void 月份日期(void);
void 初始化数组(void);
void 自动计算个数(void);
void 指定初始化(void);

int main(void){
    // 月份日期();
    // 初始化数组();
    // 自动计算个数();
    指定初始化();

    return 0;
}

void 月份日期(void){
    int 日[月份] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
    // 可以省略方括号的数字，编译器会自动匹配数组大小，初始化列表多了，会报错
    int 索引;

    for (索引 = 0; 索引 < 月份; 索引++)
        printf("%2d月有%2d天.\n", 索引 + 1, 日[索引]);
}

#define 宽度 4
void 初始化数组(void){
    int 未初始化[宽度];  // 未初始化的数组，
    // 如果是部分初始化，则未初始化到的会被初始化为0
    int i;

    printf("%2s%20s\n", "i", "未初始化[i]");
    // %20s刚好和%16d匹配，四个汉字？
    for (i = 0; i < 宽度; i++)
        printf("%2d%16d\n", i, 未初始化[i]);
}

void 自动计算个数(void){
    const int 天数[] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31 };
    int 索引;

    for (索引 = 0; 索引 < sizeof 天数 / sizeof 天数[0]; 索引++)
        printf("%2d月有%2d天。\n", 索引+1, 天数[索引]);
}

void 指定初始化(void){
    int 天数[月份] = { 31, 28, [4] = 31, 30, 31, [1] = 29 };
    // 如果不指定大小,编译器会把大小设置为足够装的下初始化的值
    // [4] = 31, 30, 31这后面的值用于指定初始化后面的原始也即是[4]后面
    // [1] = 29 会替换原来的
    // 数组的方括号中必须是非负整数
    int i;

    for (i = 0; i < 月份; i++)
        printf("%2d %d\n", i + 1, 天数[i]);
}